In [5]:
import pandas as pd
import numpy as np
import seaborn as sns
import plotly.express as px

ModuleNotFoundError: No module named 'plotly'

In [4]:
data=pd.read_csv("C:\\Users\\adars\\Downloads\\student_extended_ml_dataset2.csv")

In [5]:
data.head()

,Name,Age,Gender,Hours_Studied,IQ,Physics_Marks,Math_Marks,Chemistry_Marks,Has_Part_Time_Job,Study_Hours_Group
0,Jason Vargas,19,Male,8.140821,92,87,43,85,True,High
1,Sandra Wiggins,35,Female,9.825626,112,86,81,54,False,High
2,Julia Olsen,33,Male,8.835372,131,87,52,57,True,High
3,Robert Pennington,33,Male,2.482483,138,70,86,83,False,Low
4,Kayla Sellers,28,Female,4.419793,90,95,48,83,True,Low

In [6]:
data.tail()
#size:5000 values

,Name,Age,Gender,Hours_Studied,IQ,Physics_Marks,Math_Marks,Chemistry_Marks,Has_Part_Time_Job,Study_Hours_Group
4995,Steven Lynch,30,Female,3.653474,143,93,59,85,True,Low
4996,Donna Hamilton,33,Female,1.096493,132,68,70,99,True,Low
4997,Mrs. Ashley Howard,38,Male,4.156770,111,76,96,71,False,Low
4998,Kendra Murray,18,Female,6.788548,137,81,98,73,False,High
4999,Christine Rodriguez,38,Male,1.627111,95,52,70,74,True,Low

In [7]:
data.nunique()

Name                 4824
Age                    28
Gender                  2
Hours_Studied        5000
IQ                     71
Physics_Marks          61
Math_Marks             61
Chemistry_Marks        61
Has_Part_Time_Job       2
Study_Hours_Group       2
dtype: int64

In [9]:
data.columns

Index(['Name', 'Age', 'Gender', 'Hours_Studied', 'IQ', 'Physics_Marks',
       'Math_Marks', 'Chemistry_Marks', 'Has_Part_Time_Job',
       'Study_Hours_Group'],
      dtype='object')

In [11]:
data.isnull().sum()

Name                 0
Age                  0
Gender               0
Hours_Studied        0
IQ                   0
Physics_Marks        0
Math_Marks           0
Chemistry_Marks      0
Has_Part_Time_Job    0
Study_Hours_Group    0
dtype: int64

In [12]:
data.head()

,Name,Age,Gender,Hours_Studied,IQ,Physics_Marks,Math_Marks,Chemistry_Marks,Has_Part_Time_Job,Study_Hours_Group
0,Jason Vargas,19,Male,8.140821,92,87,43,85,True,High
1,Sandra Wiggins,35,Female,9.825626,112,86,81,54,False,High
2,Julia Olsen,33,Male,8.835372,131,87,52,57,True,High
3,Robert Pennington,33,Male,2.482483,138,70,86,83,False,Low
4,Kayla Sellers,28,Female,4.419793,90,95,48,83,True,Low

In [4]:
data.describe()[['IQ', 'Physics_Marks']]

NameError: name 'data' is not defined

In [6]:
px.box()

NameError: name 'px' is not defined